# yolo11n_lca_neck_r16.yaml — YOLO11n + LCA(Neck, reduction=16) 7 类
#
# 基于官方 yolo11n.yaml，修改：
#   1. nc: 80 → 7（LEAD-Net 7 类障碍物）
#   2. head P3 后注入 LCA 模块（reduction=16）
#
# LCA 注入点：第 16 行（P3/8-small）后的 C3k2 输出上
# 选择 P3 的理由：P3 是小目标特征图（stride 8），LEAD-Net 数据集 73% 小目标
#
# 预训练权重加载：YOLO("yolo11n_lca_neck_r16.yaml").load("yolo11n.pt")
#   - backbone + head 的 C3k2/SPPF/C2PSA/Conv 权重自动迁移
#   - LCA 层随机初始化（新增模块）
#   - cls 头 80→7 自动重初始化

# Ultralytics AGPL-3.0 License
# Parameters
nc: 7  # number of classes (LEAD-Net: person/bicycle/car/backpack/suitcase/chair/bottle)
scales:
  n: [0.50, 0.25, 1024]  # summary: 181 layers, 2.6M params, 6.6 GFLOPs (base) + LCA ~5K params

# YOLO11n backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4
  - [-1, 1, Conv, [512, 3, 2]]      # 5-P4/16
  - [-1, 2, C3k2, [512, True]]      # 6
  - [-1, 1, Conv, [1024, 3, 2]]     # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]     # 8
  - [-1, 1, SPPF, [1024, 5]]        # 9
  - [-1, 2, C2PSA, [1024]]          # 10

# YOLO11n head + LCA(Neck)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
  - [[-1, 6], 1, Concat, [1]]       # 12  cat backbone P4
  - [-1, 2, C3k2, [512, False]]     # 13
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 4], 1, Concat, [1]]       # 15  cat backbone P3
  - [-1, 2, C3k2, [256, False]]     # 16 (P3/8-small)
  - [-1, 1, LCA, [16]]              # 17 ★ LCA 注入 Neck P3，reduction=16（channels 由 lazy 从输入推断）
  - [-1, 1, Conv, [256, 3, 2]]      # 18
  - [[-1, 13], 1, Concat, [1]]      # 19  cat head P4
  - [-1, 2, C3k2, [512, False]]     # 20 (P4/16-medium)
  - [-1, 1, Conv, [512, 3, 2]]      # 21
  - [[-1, 10], 1, Concat, [1]]      # 22  cat head P5
  - [-1, 2, C3k2, [1024, True]]     # 23 (P5/32-large)
  - [[17, 20, 23], 1, Detect, [nc]] # 24  Detect(P3, P4, P5) — P3 接 LCA(17) 输出；P4/P5 索引因 LCA 插入偏移
