# yolo11n_lca_neck_r32.yaml — YOLO11n + LCA(Neck, reduction=32) 7 类
# reduction=32: 更小 mip（channels//32），更少注意力容量，参数最少
nc: 7
scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]     # 16 (P3/8-small)
  - [-1, 1, LCA, [32]]              # 17 ★ LCA reduction=32（最小容量）
  - [-1, 1, Conv, [256, 3, 2]]      # 18
  - [[-1, 13], 1, Concat, [1]]      # 19
  - [-1, 2, C3k2, [512, False]]     # 20 (P4/16-medium)
  - [-1, 1, Conv, [512, 3, 2]]      # 21
  - [[-1, 10], 1, Concat, [1]]      # 22
  - [-1, 2, C3k2, [1024, True]]     # 23 (P5/32-large)
  - [[17, 20, 23], 1, Detect, [nc]] # 24  P3 接 LCA(17) 输出
